In [1]:
import pandas as pd
import numpy as np
import seaborn as sb

In [2]:
df = pd.DataFrame({'A': ['one', 'one', 'two', 'three', 'three', 'one'], 'B': range(6)})
df

       A  B
0    one  0
1    one  1
2    two  2
3  three  3
4  three  4
5    one  5

In [3]:
df.groupby('A').apply(print)

A  B
0  one  0
1  one  1
5  one  5
       A  B
3  three  3
4  three  4
     A  B
2  two  2

Empty DataFrame
Columns: []
Index: []

In [4]:
df1 = pd.DataFrame({'lkey': ['foo', 'bar', 'baz', 'foo'],
                    'value': [1, 2, 3, 5]})
df2 = pd.DataFrame({'rkey': ['foo', 'bar', 'baz', 'foo'],
                    'value': [5, 6, 7, 8]})

In [5]:
df1

  lkey  value
0  foo      1
1  bar      2
2  baz      3
3  foo      5

In [6]:
df2

  rkey  value
0  foo      5
1  bar      6
2  baz      7
3  foo      8

In [7]:
df1.merge(df2, left_on='lkey', right_on='rkey')

  lkey  value_x rkey  value_y
0  foo        1  foo        5
1  foo        1  foo        8
2  foo        5  foo        5
3  foo        5  foo        8
4  bar        2  bar        6
5  baz        3  baz        7

In [8]:
df1.merge(df2, how = 'inner', on = "value")

  lkey  value rkey
0  foo      5  foo

In [9]:
df1.merge(df2, how = 'left', on = "value")

  lkey  value rkey
0  foo      1  NaN
1  bar      2  NaN
2  baz      3  NaN
3  foo      5  foo

In [10]:
df1.merge(df2, how = 'outer')

  lkey  value rkey
0  foo      1  NaN
1  bar      2  NaN
2  baz      3  NaN
3  foo      5  foo
4  NaN      6  bar
5  NaN      7  baz
6  NaN      8  foo

In [11]:
datetime = pd.to_datetime('20090901 10:20:30', format='%Y%m%d %H:%M:%S', errors='ignore')
datetime.date()

datetime.date(2009, 9, 1)

In [12]:
times = pd.date_range(datetime, periods=60, freq='min')
times

DatetimeIndex(['2009-09-01 10:20:30', '2009-09-01 10:21:30',
               '2009-09-01 10:22:30', '2009-09-01 10:23:30',
               '2009-09-01 10:24:30', '2009-09-01 10:25:30',
               '2009-09-01 10:26:30', '2009-09-01 10:27:30',
               '2009-09-01 10:28:30', '2009-09-01 10:29:30',
               '2009-09-01 10:30:30', '2009-09-01 10:31:30',
               '2009-09-01 10:32:30', '2009-09-01 10:33:30',
               '2009-09-01 10:34:30', '2009-09-01 10:35:30',
               '2009-09-01 10:36:30', '2009-09-01 10:37:30',
               '2009-09-01 10:38:30', '2009-09-01 10:39:30',
               '2009-09-01 10:40:30', '2009-09-01 10:41:30',
               '2009-09-01 10:42:30', '2009-09-01 10:43:30',
               '2009-09-01 10:44:30', '2009-09-01 10:45:30',
               '2009-09-01 10:46:30', '2009-09-01 10:47:30',
               '2009-09-01 10:48:30', '2009-09-01 10:49:30',
               '2009-09-01 10:50:30', '2009-09-01 10:51:30',
               '2009-09-01 10:52:30', '2009-09-01 10:53:30',
               '2009-09-01 10:54:30', '2009-09-01 10:55:30',
               '2009-09-01 10:56:30', '2009-09-01 10:57:30',
               '2009-09-01 10:58:30', '2009-09-01 10:59:30',
               '2009-09-01 11:00:30', '2009-09-01 11:01:30',
               '2009-09-01 11:02:30', '2009-09-01 11:03:30',
               '2009-09-01 11:04:30', '2009-09-01 11:05:30',
               '2009-09-01 11:06:30', '2009-09-01 11:07:30',
               '2009-09-01 11:08:30', '2009-09-01 11:09:30',
               '2009-09-01 11:10:30', '2009-09-01 11:11:30',
               '2009-09-01 11:12:30', '2009-09-01 11:13:30',
               '2009-09-01 11:14:30', '2009-09-01 11:15:30',
               '2009-09-01 11:16:30', '2009-09-01 11:17:30',
               '2009-09-01 11:18:30', '2009-09-01 11:19:30'],
              dtype='datetime64[ns]', freq='T')

In [13]:
ts = pd.Series(data = times)
ts

0    2009-09-01 10:20:30
1    2009-09-01 10:21:30
2    2009-09-01 10:22:30
3    2009-09-01 10:23:30
4    2009-09-01 10:24:30
5    2009-09-01 10:25:30
6    2009-09-01 10:26:30
7    2009-09-01 10:27:30
8    2009-09-01 10:28:30
9    2009-09-01 10:29:30
10   2009-09-01 10:30:30
11   2009-09-01 10:31:30
12   2009-09-01 10:32:30
13   2009-09-01 10:33:30
14   2009-09-01 10:34:30
15   2009-09-01 10:35:30
16   2009-09-01 10:36:30
17   2009-09-01 10:37:30
18   2009-09-01 10:38:30
19   2009-09-01 10:39:30
20   2009-09-01 10:40:30
21   2009-09-01 10:41:30
22   2009-09-01 10:42:30
23   2009-09-01 10:43:30
24   2009-09-01 10:44:30
25   2009-09-01 10:45:30
26   2009-09-01 10:46:30
27   2009-09-01 10:47:30
28   2009-09-01 10:48:30
29   2009-09-01 10:49:30
30   2009-09-01 10:50:30
31   2009-09-01 10:51:30
32   2009-09-01 10:52:30
33   2009-09-01 10:53:30
34   2009-09-01 10:54:30
35   2009-09-01 10:55:30
36   2009-09-01 10:56:30
37   2009-09-01 10:57:30
38   2009-09-01 10:58:30
39   2009-09-01 10:59:30
40   2009-09-01 11:00:30
41   2009-09-01 11:01:30
42   2009-09-01 11:02:30
43   2009-09-01 11:03:30
44   2009-09-01 11:04:30
45   2009-09-01 11:05:30
46   2009-09-01 11:06:30
47   2009-09-01 11:07:30
48   2009-09-01 11:08:30
49   2009-09-01 11:09:30
50   2009-09-01 11:10:30
51   2009-09-01 11:11:30
52   2009-09-01 11:12:30
53   2009-09-01 11:13:30
54   2009-09-01 11:14:30
55   2009-09-01 11:15:30
56   2009-09-01 11:16:30
57   2009-09-01 11:17:30
58   2009-09-01 11:18:30
59   2009-09-01 11:19:30
dtype: datetime64[ns]

In [14]:
count = pd.Series(data = range(len(times)) , index = times)

In [15]:
pd.Series(data = range(len(times)))

0      0
1      1
2      2
3      3
4      4
5      5
6      6
7      7
8      8
9      9
10    10
11    11
12    12
13    13
14    14
15    15
16    16
17    17
18    18
19    19
20    20
21    21
22    22
23    23
24    24
25    25
26    26
27    27
28    28
29    29
30    30
31    31
32    32
33    33
34    34
35    35
36    36
37    37
38    38
39    39
40    40
41    41
42    42
43    43
44    44
45    45
46    46
47    47
48    48
49    49
50    50
51    51
52    52
53    53
54    54
55    55
56    56
57    57
58    58
59    59
dtype: int64

In [16]:
pd.DataFrame(data=count, index=ts)

                      0
2009-09-01 10:20:30   0
2009-09-01 10:21:30   1
2009-09-01 10:22:30   2
2009-09-01 10:23:30   3
2009-09-01 10:24:30   4
2009-09-01 10:25:30   5
2009-09-01 10:26:30   6
2009-09-01 10:27:30   7
2009-09-01 10:28:30   8
2009-09-01 10:29:30   9
2009-09-01 10:30:30  10
2009-09-01 10:31:30  11
2009-09-01 10:32:30  12
2009-09-01 10:33:30  13
2009-09-01 10:34:30  14
2009-09-01 10:35:30  15
2009-09-01 10:36:30  16
2009-09-01 10:37:30  17
2009-09-01 10:38:30  18
2009-09-01 10:39:30  19
2009-09-01 10:40:30  20
2009-09-01 10:41:30  21
2009-09-01 10:42:30  22
2009-09-01 10:43:30  23
2009-09-01 10:44:30  24
2009-09-01 10:45:30  25
2009-09-01 10:46:30  26
2009-09-01 10:47:30  27
2009-09-01 10:48:30  28
2009-09-01 10:49:30  29
2009-09-01 10:50:30  30
2009-09-01 10:51:30  31
2009-09-01 10:52:30  32
2009-09-01 10:53:30  33
2009-09-01 10:54:30  34
2009-09-01 10:55:30  35
2009-09-01 10:56:30  36
2009-09-01 10:57:30  37
2009-09-01 10:58:30  38
2009-09-01 10:59:30  39
2009-09-01 11:00:30  40
2009-09-01 11:01:30  41
2009-09-01 11:02:30  42
2009-09-01 11:03:30  43
2009-09-01 11:04:30  44
2009-09-01 11:05:30  45
2009-09-01 11:06:30  46
2009-09-01 11:07:30  47
2009-09-01 11:08:30  48
2009-09-01 11:09:30  49
2009-09-01 11:10:30  50
2009-09-01 11:11:30  51
2009-09-01 11:12:30  52
2009-09-01 11:13:30  53
2009-09-01 11:14:30  54
2009-09-01 11:15:30  55
2009-09-01 11:16:30  56
2009-09-01 11:17:30  57
2009-09-01 11:18:30  58
2009-09-01 11:19:30  59

In [17]:
rev = pd.Series(data = range(len(times))).iloc[::-1]

In [20]:
df = pd.DataFrame(data=dict(count = count, rev_count = rev.index), index=ts)

In [21]:
df.head()

                     count  rev_count
2009-09-01 10:20:30      0         59
2009-09-01 10:21:30      1         58
2009-09-01 10:22:30      2         57
2009-09-01 10:23:30      3         56
2009-09-01 10:24:30      4         55

In [30]:
df.resample('5T').mean()

                     count  rev_count
2009-09-01 10:20:00      2         57
2009-09-01 10:25:00      7         52
2009-09-01 10:30:00     12         47
2009-09-01 10:35:00     17         42
2009-09-01 10:40:00     22         37
2009-09-01 10:45:00     27         32
2009-09-01 10:50:00     32         27
2009-09-01 10:55:00     37         22
2009-09-01 11:00:00     42         17
2009-09-01 11:05:00     47         12
2009-09-01 11:10:00     52          7
2009-09-01 11:15:00     57          2

In [37]:
df.aggregate(['std'])

         count  rev_count
std  17.464249  17.464249

In [40]:
type(df.index[0])

pandas._libs.tslibs.timestamps.Timestamp

In [48]:
type(df.index)

pandas.core.indexes.datetimes.DatetimeIndex

In [50]:
type(pd.Period('2012-05', freq='D'))

pandas._libs.tslibs.period.Period